Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [5]:
import pandas as pd

d = [4,8,15,16,23,42]

ds = pd.Series(d)
print(type(ds))

ds

<class 'pandas.core.series.Series'>

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [2]:
import pandas as pd

d = [i for i in range(0,10)]

ds = pd.Series(d)

print(ds)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [3]:
import pandas as pd

data = {'Name':['Alice','Bob','Claire'],
       'Age':[25,30,27],
       'Gender':['Female','Male','Female']}

df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A DataFrame is a two-dimensional labeled data sturcture. It is one of the key data structure provided by the pandas library, which is widely used for data manipulation and data anlysis in python.
A DataFrame can be thought of as table, where data is organized in row and column, Each column in a DataFrame represents a different variable or feature, while each row represents a specific observation or data point. This tabular structure makes it easy to work with structured data

While a DataFrame is a two-dimensional data structure in pandas, a pandas Series is a one-dimensional array-like object. Here are the main differences between a DataFrame and a Series:

1. Dimensions: A DataFrame consists of multiple columns, where each column can contain different types of data. In contrast, a Series has only one column.

2. Labels: In a DataFrame, both the rows and columns have labels, allowing for easy indexing and selection of data. Each column in a DataFrame has its own label, which can be used to access specific columns or perform column-wise operations. In a Series, the data is associated with a single index, allowing for efficient access to individual elements.

3. Tabular Structure: DataFrames are tabular structures, similar to a table in a spreadsheet, with rows and columns. On the other hand, a Series is more like a single column of data, with an index associated with each element.

4. Operations: DataFrames and Series support different operations. DataFrames are designed for operations that involve multiple columns, such as merging, reshaping, or aggregating data across different variables. Series, on the other hand, are more suitable for operations that involve single columns, like mathematical computations or data selection based on specific conditions.

5. Data Type: While a DataFrame can contain columns with different data types, a Series has a homogeneous data type for all its elements. This allows DataFrames to handle mixed data more efficiently, whereas Series are optimized for working with homogeneous data.

Example:- 

import pandas as pd

data = {'Name':['Alice','Bob','Claire'],
       
       'Age':[25,30,27],
       
       'Gender':['Female','Male','Female']}

df = pd.DataFrame(data)

#DataFrame

print(df)

#Print Series
print(df['Age'])

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Pandas provides a wide range of functions and methods to manipulate data in a DataFrame. Here are some common functions:

1. head() and tail(): These functions allow you to view the first or last few rows of a DataFrame, respectively. They are useful for quickly inspecting the data and getting a glimpse of its structure.

2. info(): This function provides a concise summary of a DataFrame, including the data types, column names, and non-null values. It is useful for understanding the overall structure of the data.

3. shape: This attribute returns the dimensions of a DataFrame as a tuple (number of rows, number of columns). It is handy for quickly checking the size of the DataFrame.

4. describe(): This function generates various summary statistics of the numerical columns in a DataFrame, such as count, mean, standard deviation, minimum, maximum, and quartiles. It helps to gain insights into the distribution and basic statistics of the data.

In [13]:
import pandas as pd
data = {'name':['Rohit', 'Mohit','Ram','Shyam','Rohan','Rahul','Mohan','Shreya'],
       'Age':[17,18,21,19,34,15,24,25],
       'course':['DSA','C','C++','JAVA','DS','PHP','JAVASCRIPT','PYTHON']}

df = pd.DataFrame(data)
df.head(5)

    name  Age course
0  Rohit   17    DSA
1  Mohit   18      C
2    Ram   21    C++
3  Shyam   19   JAVA
4  Rohan   34     DS

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

1. Series: A pandas Series is mutable, meaning its values can be modified after it has been created. You can change or update the values of individual elements in a Series.

2. DataFrame: Similarly, a pandas DataFrame is mutable. You can modify the values of specific cells, add or remove rows or columns, and perform various operations that change the data within the DataFrame.

3. Panel: The pandas Panel was a three-dimensional data structure that could hold multiple DataFrames called items, each representing a different dataset. However, it has been deprecated since pandas version 0.20.0 and is no longer available in more recent versions. The recommended approach for working with three-dimensional data is to use multi-indexing in a DataFrame.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [14]:
import pandas as pd

Name = pd.Series(['Rohit', 'Mohit','Ram','Shyam','Rohan','Rahul','Mohan','Shreya'])
Age = pd.Series([17,18,21,19,34,15,24,25])
Course = pd.Series(['DSA','C','C++','JAVA','DS','PHP','JAVASCRIPT','PYTHON'])

data = {'Name':Name,'Age':Age,'Course':Course}

df = pd.DataFrame(data)
df

     Name  Age      Course
0   Rohit   17         DSA
1   Mohit   18           C
2     Ram   21         C++
3   Shyam   19        JAVA
4   Rohan   34          DS
5   Rahul   15         PHP
6   Mohan   24  JAVASCRIPT
7  Shreya   25      PYTHON